[["Em que pilares a teoria do Scrum se baseia?", "Planejamento, execução, controle e entrega.", "Transparência, inspeção e adaptação.", "Comunicação, colaboração, integração e entrega.", "Visão, alinhamento, iteração e valor.", "b"], ["Qual a importância do feedback constante no Scrum?", "Serve apenas para satisfazer o cliente.", "É essencial para a inspeção e adaptação, permitindo que a equipe ajuste o curso e melhore o produto.", "É importante apenas no final de cada Sprint.", "É responsabilidade exclusiva do Product Owner.", "b"], ["Qual a importância da comunicação entre o Product Owner e os Developers?", "A comunicação entre o Product Owner e os Developers é importante apenas durante a Sprint Planning.", "A comunicação constante entre o Product Owner e os Developers gera ruído e deve ser evitada.", "A comunicação clara, constante e transparente entre o Product Owner e os Developers é fundamental para o sucesso do Scrum, pois garante que todos estejam alinhados em relação à visão do produto, às prioridades e aos requisitos.", "O Product Owner deve se comunicar apenas com o Scrum Master, que será o responsável por repassar as informações para os Developers.", "c"], ["Qual a relação entre a Teoria do Scrum e os valores do Scrum?", "Não há relação entre os dois.", "Os valores do Scrum são independentes da Teoria do Scrum.", "A Teoria do Scrum define os valores do Scrum.", "Os valores do Scrum são a base para a aplicação da Teoria do Scrum.", "d"], ["Quem faz parte do Scrum Team?", "Product Owner, Gerente de Projeto e Desenvolvedores.", "Product Owner, Scrum Master e Desenvolvedores.", "Scrum Master, Desenvolvedores e Testadores.", "Product Owner, Scrum Master, Desenvolvedores e Stakeholders.", "b"], ["Qual a importância de se praticar os valores do Scrum no dia a dia do trabalho?", "Os valores do Scrum são apenas teorias bonitas, mas que não funcionam na prática.", "A prática dos valores do Scrum é fundamental para criar uma cultura de colaboração, confiança e alto desempenho, que são essenciais para o sucesso do Scrum.", "Basta conhecer os valores do Scrum para que eles se manifestem na prática.", "Os valores do Scrum são importantes apenas para o Scrum Master e o Product Owner.", "b"], ["Qual o tamanho ideal de um Scrum Team, segundo o Guia Scrum?", "Entre 3 e 5 pessoas.", "Pequeno o suficiente para se manter ágil e grande o suficiente para completar um trabalho significativo dentro de uma Sprint, normalmente 10 pessoas ou menos.", "Depende do tamanho do projeto, podendo chegar a 20 pessoas.", "Não há um limite definido, quanto mais pessoas, melhor.", "b"], ["Como o Scrum Team lida com conflitos internos?", "Ignorando os conflitos, pois eles se resolvem sozinhos.", "Deixando o Scrum Master resolver todos os conflitos.", "Abordando os conflitos de forma aberta e transparente, buscando soluções que beneficiem a equipe como um todo.", "Votando para decidir qual solução será implementada, mesmo que gere insatisfação.", "c"], ["Qual o principal objetivo da adaptação no Scrum?", "Garantir que a equipe esteja sempre progredindo em direção aos objetivos de negócio, mesmo quando as circunstâncias mudam.", "Manter o plano original a todo custo.", "Evitar conflitos e debates dentro da equipe.", "Satisfazer todos os desejos dos stakeholders.", "a"], ["Qual a relação do Scrum com processos, técnicas e métodos?", "O Scrum substitui todos os processos, técnicas e métodos existentes.", "O Scrum é incompatível com a maioria dos processos, técnicas e métodos.", "O Scrum se acopla a práticas existentes ou as torna desnecessárias, tornando sua eficácia visível.", "O Scrum exige a utilização de um conjunto específico de processos, técnicas e métodos.", "c"], ["Qual a importância da adaptação para o sucesso a longo prazo de um time Scrum?", "A adaptação garante o sucesso do time Scrum.", "A adaptação permite que o time Scrum se torne mais resiliente, eficaz e capaz de lidar com a complexidade e as mudanças constantes do mercado.", "A adaptação é importante apenas para times Scrum iniciantes.", "A adaptação torna o time Scrum menos produtivo, pois gera retrabalho.", "b"], ["Como o Scrum garante que a equipe esteja trabalhando nas tarefas mais importantes?", "Deixando a equipe decidir livremente em quais tarefas trabalhar.", "Utilizando gráficos de Gantt para controlar o progresso de cada tarefa.", "Priorizando os itens do Product Backlog e definindo a Meta da Sprint.", "Realizando reuniões diárias para verificar o status de cada tarefa.", "c"], ["Qual a importância do Scrum Master ser um líder servidor?", "O Scrum Master deve ser um líder autoritário para garantir que a equipe siga as suas ordens.", "O Scrum Master deve servir ao Scrum Team, ao Product Owner e à organização, removendo impedimentos, facilitando a comunicação e o aprendizado e promovendo a auto-organização.", "O Scrum Master deve focar apenas em garantir que a equipe siga o processo Scrum, sem se preocupar com os resultados.", "O Scrum Master deve ser o especialista técnico da equipe e resolver todos os problemas complexos.", "b"], ["O que o Product Owner deve fazer se um stakeholder solicitar uma mudança no produto durante a Sprint?", "Interromper a Sprint imediatamente para implementar a mudança.", "Adicionar a mudança ao Sprint Backlog, mesmo que isso comprometa a Meta da Sprint.", "Ignorar a solicitação do stakeholder e continuar com o plano original.", "Conversar com o stakeholder, entender o impacto da mudança, o valor que ela gera e negociar a sua inclusão em uma Sprint futura, durante o refinamento do Product Backlog.", "d"], ["O que a inspeção representa dentro do Scrum?", "Uma atividade crucial para garantir que o framework esteja sendo aplicado corretamente e gere os resultados esperados.", "Uma tarefa exclusiva do Scrum Master para verificar o trabalho da equipe.", "Um processo burocrático que atrasa o desenvolvimento do projeto.", "Uma atividade opcional que pode ser realizada apenas quando houver tempo disponível.", "a"], ["O que a equipe deve fazer quando a inspeção durante a Sprint Review identifica que o produto não atende às expectativas dos stakeholders?", "Ignorar o feedback dos stakeholders e continuar como planejado.", "Argumentar com os stakeholders e defender o trabalho da equipe.", "Ajustar o Product Backlog e planejar as adaptações necessárias para as próximas Sprints.", "Cancelar o projeto, pois não atendeu às expectativas.", "c"], ["Qual o papel da transparência na inspeção dentro do Scrum?", "A transparência não é relevante para a inspeção.", "A transparência é essencial para a inspeção, pois permite que todos os envolvidos tenham uma visão clara do que está acontecendo.", "A transparência dificulta a inspeção, pois gera um excesso de informações.", "A transparência torna a inspeção desnecessária, pois todos já sabem o que está acontecendo.", "b"], ["O que o Scrum Master deve fazer se a equipe estiver tendo dificuldades para trabalhar em conjunto?", "Culpar os membros da equipe que não estão colaborando.", "Definir regras e processos rígidos para controlar o trabalho da equipe.", "Substituir os membros da equipe que não se adaptam ao Scrum.", "Facilitar workshops e dinâmicas para fortalecer a comunicação, o respeito mútuo e a colaboração entre os membros da equipe, além de identificar e remover os impedimentos que dificultam o trabalho em equipe.", "d"], ["O que significa “falhar cedo e aprender rápido” no contexto do Scrum?", "Entregar um produto com falhas para o cliente o mais rápido possível.", "Desistir do projeto ao primeiro sinal de problema.", "Identificar e corrigir erros o mais cedo possível, reduzindo o custo e o impacto das falhas.", "Não se preocupar com a qualidade do produto nas primeiras Sprints.", "c"], ["Qual a relação entre a inspeção e a adaptação no Scrum?", "A inspeção sem adaptação é inútil. A inspeção serve para identificar o que precisa ser adaptado.", "A adaptação deve acontecer antes da inspeção.", "A inspeção e a adaptação são atividades independentes.", "A adaptação só deve ocorrer se a inspeção identificar um problema grave.", "a"], ["Como o valor “respeito” se manifesta no dia a dia de um time Scrum?", "Evitando dar feedback para não ofender os colegas.", "Valorizando as opiniões, habilidades e experiências de cada membro da equipe.", "Aceitando passivamente as decisões do Scrum Master, mesmo que não concorde.", "Focando apenas no seu trabalho e ignorando o que os outros estão fazendo.", "b"], ["Qual o objetivo principal do Scrum?", "Eliminar todos os riscos de um projeto.", "Gerar valor por meio de soluções adaptativas para problemas complexos.", "Definir um plano detalhado no início do projeto e segui-lo rigorosamente.", "Garantir que o projeto seja entregue dentro do prazo e orçamento estipulados.", "b"], ["O Scrum é mais comumente utilizado em que área?", "Engenharia civil.", "Medicina.", "Desenvolvimento de software.", "Marketing.", "c"], ["Qual a principal responsabilidade dos Developers no Scrum?", "Gerenciar o Product Backlog.", "Facilitar os eventos Scrum.", "Entregar um Incremento “Pronto” no final de cada Sprint que atenda à Definição de “Pronto”.", "Comunicar o progresso do projeto para os stakeholders.", "c"], ["De que forma a adaptação contribui para a entrega de valor em um projeto Scrum?", "A adaptação atrasa a entrega de valor, pois gera retrabalho.", "A adaptação permite que a equipe entregue um produto que atenda às necessidades reais dos usuários, mesmo que essas necessidades mudem ao longo do projeto.", "A adaptação torna o produto mais caro e complexo.", "A adaptação é importante apenas para projetos de software.", "b"], ["O que o Scrum Master deve fazer se identificar um risco que possa comprometer o sucesso do projeto?", "Esconder o risco para não gerar pânico na equipe.", "Resolver o risco sozinho, sem envolver a equipe.", "Esperar até o final da Sprint para comunicar o risco ao Product Owner.", "Comunicar o risco ao Scrum Team e ao Product Owner o mais rápido possível, ajudando a equipe a planejar e implementar as ações necessárias para mitigá-lo.", "d"], ["Como o Scrum Master ajuda a organização a adotar o Scrum?", "Implementando o Scrum em todos os projetos da empresa de uma só vez.", "Definindo regras e processos rígidos para garantir que o Scrum seja seguido à risca.", "Treinando e educando os colaboradores sobre o Scrum, seus valores e princípios, além de facilitar a mudança cultural necessária para a adoção do Scrum.", "Contratando consultores externos para implementar o Scrum na empresa.", "c"], ["Qual a importância da colaboração e do trabalho em equipe em um Scrum Team?", "A colaboração e o trabalho em equipe são importantes, mas não essenciais para o sucesso do Scrum.", "A colaboração é importante apenas entre os Desenvolvedores, não envolvendo o Product Owner ou o Scrum Master.", "A colaboração e o trabalho em equipe são fundamentais para o Scrum, pois permitem que a equipe utilize o conhecimento e as habilidades de todos para entregar o máximo valor.", "A colaboração deve ser evitada ao máximo, pois gera conflitos e atrasos no projeto.", "c"], ["Como a transparência contribui para a tomada de decisões no Scrum?", "Elimina a necessidade de tomar decisões difíceis.", "Permite que as decisões sejam tomadas com base em informações claras, reais e visíveis a todos.", "Torna o processo de tomada de decisão mais lento e burocrático.", "Centraliza as decisões no Product", "b"], ["Qual a principal diferença entre o Scrum e o gerenciamento tradicional de projetos?", "O Scrum não utiliza cronogramas.", "O Scrum não se preocupa com o orçamento do projeto.", "O Scrum é iterativo e incremental, enquanto o gerenciamento tradicional é geralmente linear e preditivo.", "O Scrum não envolve stakeholders.", "c"], ["Quando a adaptação deve acontecer em um projeto Scrum?", "Apenas no final do projeto.", "Somente quando solicitado pelo Product Owner.", "O mais rápido possível, assim que a necessidade de mudança for identificada.", "Apenas se a mudança for pequena e não impactar o prazo final.", "c"], ["Qual a relação entre transparência e a Definição de “Pronto” no Scrum?", "Não há relação entre os dois conceitos.", "A Definição de “Pronto” precisa ser clara e transparente para que todos os envolvidos saibam o que esperar do trabalho da equipe.", "A Definição de “Pronto” é definida pelo Scrum Master e mantida em segredo para evitar conflitos.", "A Definição de “Pronto” é um documento extenso e detalhado que define todos os aspectos do produto.", "b"], ["O que os Developers devem fazer se identificarem que não conseguirão finalizar todos os itens do Sprint Backlog durante a Sprint?", "Trabalhar horas extras para tentar entregar tudo.", "Esconder a informação do Scrum Master e do Product Owner.", "Comunicar o problema ao Product Owner o mais rápido possível para que ele renegocie o escopo da Sprint.", "Remover os itens mais complexos do Sprint Backlog e adicioná-los em uma Sprint futura.", "c"], ["O que os Developers devem fazer se precisarem de ajuda de um especialista que não faz parte do Scrum Team?", "Tentar resolver o problema sozinhos para não incomodar ninguém.", "Esperar até o final da Sprint para pedir ajuda.", "Pedir autorização ao Scrum Master para conversar com o especialista.", "Comunicar a necessidade ao Scrum Master e colaborar na busca por uma solução, que pode envolver a participação do especialista na Sprint.", "d"], ["O que pode acontecer quando há falta de transparência no Scrum?", "A equipe e os stakeholders podem ter dificuldade em colaborar e tomar decisões eficazes.", "O projeto se torna mais fácil de gerenciar, pois há menos informações para se preocupar.", "A equipe se torna mais motivada, pois não precisa se preocupar em comunicar o progresso.", "O projeto se torna mais previsível, pois todos trabalham com as mesmas informações limitadas.", "a"], ["Qual a importância da experimentação no Scrum?", "É desencorajada, pois gera atrasos no projeto.", "É importante apenas na fase inicial do projeto.", "É fundamental para aprender e melhorar continuamente o produto e o processo.", "É responsabilidade exclusiva do Scrum Master.", "c"], ["Como o Scrum Master ajuda o Scrum Team a ser mais eficaz?", "Controlando o trabalho da equipe e cobrando resultados.", "Tomando as decisões para que a equipe não perca tempo discutindo.", "Removendo impedimentos, facilitando a comunicação e a colaboração, ensinando as práticas do Scrum e promovendo a auto-organização.", "Criando relatórios e gráficos para monitorar o desempenho da equipe.", "c"], ["Quais elementos podem ser adaptados em um projeto Scrum?", "Apenas o código fonte do produto.", "O plano do projeto, o próprio produto, o processo Scrum, as ferramentas utilizadas, ou qualquer outro elemento que seja necessário para atingir os objetivos.", "Somente a documentação do projeto.", "Apenas os prazos e o orçamento do projeto.", "b"], ["No Scrum, o que significa ter \"transparência\"?", "Tornar as informações relevantes visíveis e acessíveis a todos os envolvidos no projeto.", "Documentar todos os detalhes do projeto em um sistema online.", "Compartilhar todas as informações, mesmo as irrelevantes, para evitar conflitos.", "Permitir que apenas o Scrum Master tenha acesso às informações do projeto.", "a"], ["Como o Scrum lida com a incerteza em projetos complexos?", "Tentando eliminar todos os riscos e incertezas no início do projeto.", "Definindo um plano detalhado e imutável para lidar com todas as situações.", "Aceitando a incerteza e utilizando a inspeção e adaptação para lidar com ela.", "Ignorando a incerteza e focando apenas no que é conhecido.", "c"], ["Qual o papel da transparência na adaptação dentro do Scrum?", "A transparência não é relevante para a adaptação.", "A transparência é essencial para a adaptação, pois permite que a equipe tome decisões mais eficazes e implemente as mudanças necessárias de forma colaborativa.", "A transparência dificulta a adaptação, pois gera resistência a mudanças.", "A transparência torna a adaptação desnecessária, pois todos já estão cientes dos problemas.", "b"], ["O que significa dizer que o Scrum é um framework “leve”?", "Que ele pode ser aplicado apenas em projetos pequenos.", "Que ele não exige documentação.", "Que ele é fácil de aprender, mas difícil de dominar.", "Que ele é simples de entender, mas exige trabalho para ser implementado com sucesso.", "d"], ["Qual a relação entre o Product Owner e a Definição de “Pronto”?", "O Product Owner define a Definição de “Pronto” no início do projeto e não participa da sua atualização.", "O Product Owner participa da definição e atualização da Definição de “Pronto”, garantindo que ela atenda às suas expectativas de qualidade e aos critérios de aceite do produto.", "A Definição de “Pronto” é definida pelos Developers e o Product Owner apenas a valida.", "A Definição de “Pronto” é um documento técnico que não envolve o Product Owner.", "d"], ["O que NÃO é um princípio fundamental da Teoria do Scrum?", "Colaboração e trabalho em equipe.", "Entrega de valor em ciclos curtos.", "Micromanagement e controle.", "Adaptação e melhoria contínua.", "c"], ["Quais são os cinco valores fundamentais do Scrum?", "Coragem, Foco, Comprometimento, Respeito e Transparência.", "Coragem, Foco, Comprometimento, Respeito e Abertura.", "Coragem, Foco, Comunicação, Respeito e Abertura.", "Disciplina, Foco, Comprometimento, Respeito e Abertura.", "b"], ["Como a adaptação pode ajudar a gerenciar os riscos em um projeto Scrum?", "A adaptação elimina todos os riscos do projeto.", "A adaptação permite que a equipe responda aos riscos de forma proativa, ajustando o plano ou o produto conforme necessário.", "A adaptação aumenta os riscos do projeto, pois gera incerteza.", "A adaptação é irrelevante para o gerenciamento de riscos no Scrum.", "b"], ["Para que tipo de problema o Scrum é mais indicado?", "Problemas complexos com alto grau de incerteza.", "Problemas simples que podem ser facilmente resolvidos com um plano definido.", "Problemas que exigem um controle rígido sobre o processo.", "Problemas que não exigem a participação ativa do cliente.", "a"], ["Qual a principal característica de um Scrum Team?", "Ser organizado por funções, com hierarquia clara e bem definida.", "Ser autogerenciado e multifuncional, com autonomia para organizar o trabalho e entregar valor a cada Sprint.", "Ter um gerente de projeto para tomar as decisões e delegar as tarefas.", "Ser composto por um grande número de pessoas para garantir a especialização.", "b"], ["Como os Developers garantem a qualidade do Incremento?", "Deixando os testes para o final da Sprint.", "Confiando que o Product Owner irá identificar os erros.", "Definindo e seguindo uma Definição de “Pronto” clara e rigorosa.", "Utilizando apenas ferramentas de automação de testes.", "d"], ["Como o Scrum Team garante que todos estejam trabalhando na mesma direção?", "Seguindo um plano detalhado e imutável definido no início do projeto.", "Definindo uma Meta da Sprint clara e compartilhada, que serve como guia para as decisões e ações da equipe.", "Realizando reuniões diárias longas e improdutivas para discutir o andamento de cada tarefa.", "Deixando o Product Owner tomar todas as decisões, sem consultar a equipe.", "b"], ["O que o Scrum Master deve fazer se a organização estiver resistindo à adoção do Scrum?", "Forçar a implementação do Scrum, mesmo que haja resistência.", "Desistir de implementar o Scrum e continuar com o processo tradicional.", "Culpar a organização por não entender os benefícios do Scrum.", "Comunicar os benefícios do Scrum de forma clara e objetiva, identificar os pontos de resistência e trabalhar em conjunto com a organização para encontrar soluções que facilitem a adoção do Scrum.", "d"], ["Qual a relação entre o Scrum Master e o Product Owner?", "O Scrum Master é o chefe do Product Owner.", "O Scrum Master ajuda o Product Owner a gerenciar o Product Backlog de forma eficaz, a definir a Meta do Produto e a se comunicar com os stakeholders.", "O Scrum Master e o Product Owner não precisam se comunicar, pois possuem responsabilidades distintas.", "O Scrum Master deve seguir as ordens do Product Owner, mesmo que não concorde com elas.", "b"], ["O que significa dizer que o Scrum é empírico?", "Que ele é baseado em dados estatísticos.", "Que ele se baseia na experiência e no aprendizado a partir do que já aconteceu.", "Que ele é um processo puramente teórico.", "Que ele não permite mudanças no plano original.", "b"], ["O que é Scrum?", "Uma metodologia de gerenciamento de projetos.", "Um framework leve que ajuda a entregar valor por meio de soluções adaptativas.", "Um conjunto de ferramentas para desenvolvimento de software.", "Um processo linear e preditivo para gerenciar o trabalho.", "b"], ["Como o valor “foco” se manifesta em um time Scrum?", "Trabalhando em várias tarefas ao mesmo tempo para aumentar a produtividade.", "Concentrando seus esforços na Meta da Sprint e nos itens do Sprint Backlog.", "Mudando constantemente de prioridades para atender a todos os pedidos dos stakeholders.", "Priorizando tarefas urgentes, mesmo que não sejam importantes.", "b"], ["Como a transparência se aplica à comunicação com os stakeholders?", "Os stakeholders devem ter acesso irrestrito a todas as informações do projeto.", "Os stakeholders devem receber informações relevantes e atualizadas sobre o progresso do projeto de forma regular e transparente.", "A comunicação com os stakeholders deve ser evitada ao máximo para não gerar expectativas.", "O Scrum Master é o único responsável por comunicar com os stakeholders.", "b"], ["O que significa ter “abertura” dentro do Scrum?", "Compartilhar todos os tipos de informações, mesmo as irrelevantes.", "Estar receptivo a novas ideias, feedback e perspectivas diferentes.", "Falar abertamente sobre os seus colegas de trabalho, mesmo que seja de forma negativa.", "Concordar com todas as sugestões dos stakeholders, mesmo que não sejam viáveis.", "b"], ["Quais são os três artefatos do Scrum que promovem a transparência?", "Product Backlog, Sprint Backlog e Incremento.", "Visão do produto, Roadmap do produto e Backlog de Riscos.", "Diagrama de Gantt, Diagrama de Fluxo e Kanban.", "Relatório de Status, Atas de Reunião e Planilha de Orçamento.", "a"], ["O que significa ter “coragem” no contexto do Scrum?", "Evitar tomar decisões difíceis para não gerar conflitos.", "Focar apenas em tarefas fáceis e que tragam resultados rápidos.", "Defender suas ideias e fazer o que é certo, mesmo que seja difícil ou impopular.", "Trabalhar longas horas para cumprir prazos irreais.", "c"], ["Como o Product Owner garante que o Product Backlog esteja sempre atualizado e reflita as necessidades do mercado?", "Atualizando o Product Backlog apenas no início de cada Sprint.", "Deixando a equipe de desenvolvimento adicionar novos itens ao Product Backlog conforme necessário.", "Refinando o Product Backlog constantemente, com base no feedback dos stakeholders e nas mudanças do mercado.", "Criando um Product Backlog extenso e detalhado no início do projeto e não alterando mais.", "c"], ["O que os Developers devem fazer se descobrirem um novo trabalho durante a Sprint que não estava previsto no Sprint Backlog?", "Adicionar o novo trabalho ao Sprint Backlog e tentar entregar tudo.", "Ignorar o novo trabalho e focar no que já estava planejado.", "Pedir autorização ao Scrum Master para adicionar o novo trabalho ao Sprint Backlog.", "Comunicar o novo trabalho ao Product Owner para que ele avalie o impacto na Meta da Sprint e decida o que fazer.", "d"], ["O que os Developers devem fazer se não houver um consenso sobre como resolver um problema técnico?", "Votar para decidir qual solução será implementada.", "Deixar o Scrum Master tomar a decisão.", "Discutir as diferentes opções com o time, buscando uma solução que atenda às necessidades do projeto e gere o maior valor.", "Consultar um especialista externo para que ele decida a melhor solução.", "c"], ["De que forma a transparência impacta na cultura de uma equipe Scrum?", "Incentiva a confiança, a colaboração e a responsabilidade compartilhada.", "Cria um ambiente de competição e individualismo.", "Desencoraja a comunicação aberta e honesta.", "Torna a equipe resistente a mudanças.", "a"], ["Qual a importância do aprendizado contínuo para um Scrum Team?", "O aprendizado contínuo é importante apenas para os Desenvolvedores.", "O aprendizado contínuo é importante apenas no início do projeto.", "O aprendizado contínuo é fundamental para que o Scrum Team se adapte às mudanças, melhore o seu processo de trabalho e entregue produtos de alto valor de forma consistente.", "O aprendizado contínuo atrasa o projeto e deve ser evitado.", "c"], ["Qual a importância da inspeção do Sprint Backlog durante a Daily Scrum?", "Serve para o Scrum Master controlar o trabalho da equipe.", "Ajuda a equipe a se manter no caminho certo e a identificar impedimentos ou desvios em relação à Meta da Sprint.", "É uma oportunidade para adicionar novas tarefas ao Sprint Backlog.", "É o momento ideal para discutir soluções técnicas complexas.", "b"], ["Qual a importância da inspeção para o sucesso a longo prazo de um produto desenvolvido com Scrum?", "A inspeção garante o sucesso do produto.", "A inspeção permite que a equipe adapte o produto às necessidades do mercado e às mudanças nas condições de negócio.", "A inspeção é importante apenas no início do desenvolvimento do produto.", "A inspeção torna o produto mais caro e demorado para ser desenvolvido.", "b"], ["Quem é responsável por definir a ordem de prioridade dos itens no Product Backlog?", "O Scrum Master", "Os Developers.", "O Product Owner, utilizando critérios como valor de negócio, risco, dependência e urgência.", "O cliente que encomendou o projeto.", "c"], ["O que significa ter “comprometimento” no contexto do Scrum?", "Aceitar trabalhar horas extras sem questionar.", "Assumir a responsabilidade pelo trabalho e se dedicar para alcançar os objetivos da equipe.", "Concordar com tudo o que o Scrum Master ou o Product Owner decidirem.", "Manter o plano original, mesmo que não faça mais sentido.", "b"], ["Qual a importância do feedback dos stakeholders para o Product Owner?", "O feedback dos stakeholders é importante, mas o Product Owner tem autonomia para decidir o que fazer com ele.", "O feedback dos stakeholders é importante apenas no final do projeto.", "O feedback dos stakeholders é fundamental para que o Product Owner possa validar suas hipóteses, identificar novas necessidades e oportunidades e garantir que o produto entregue o máximo valor.", "O Product Owner deve buscar feedback dos stakeholders apenas quando solicitado.", "c"], ["Com qual frequência a inspeção deve acontecer em um projeto Scrum?", "Apenas no final do projeto.", "Uma vez por mês.", "Em intervalos regulares, definidos pelo Time Box de cada evento Scrum.", "Apenas quando solicitado pelo Product Owner.", "c"], ["Qual a importância do Scrum Master ter um bom conhecimento da Teoria do Scrum?", "O Scrum Master precisa apenas saber aplicar as práticas do Scrum, sem se preocupar com a teoria.", "O Scrum Master precisa ter um profundo conhecimento da Teoria do Scrum para poder guiar a equipe e a organização na sua aplicação, adaptando o Scrum às suas necessidades e contexto.", "A Teoria do Scrum é complexa e irrelevante para o trabalho do Scrum Master.", "O Scrum Master deve ser um acadêmico e especialista em Scrum, sem se preocupar com a prática.", "b"], ["Qual a relação entre o Product Owner e a Meta do Produto?", "A Meta do Produto é definida pelo Scrum Master e o Product Owner precisa garantir que ela seja atingida.", "A Meta do Produto é definida pela equipe de desenvolvimento e o Product Owner a valida.", "A Meta do Produto é definida pelo Product Owner e serve como uma bússola para guiar o desenvolvimento do produto a longo prazo.", "A Meta do Produto é um documento estático que não pode ser alterada após a primeira Sprint.", "c"], ["Quem decide como o trabalho será realizado dentro da Sprint?", "O Product Owner.", "O Scrum Master.", "Os Developers, pois são eles que conhecem o trabalho e as melhores formas de realizá-lo.", "O Gerente de Projeto.", "c"], ["De que forma os valores do Scrum contribuem para a adaptação a mudanças?", "Os valores do Scrum tornam a equipe resistente a mudanças.", "Os valores do Scrum ajudam a equipe a ser mais flexível, aberta a novas ideias e disposta a ajustar o curso quando necessário.", "Os valores do Scrum eliminam a necessidade de adaptação a mudanças.", "Os valores do Scrum são importantes apenas para projetos com baixo grau de incerteza.", "b"], ["Quem é responsável por decidir quais adaptações serão implementadas em um projeto Scrum?", "Apenas o Scrum Master.", "Apenas o Product Owner.", "O Scrum Team, em colaboração com os stakeholders.", "O departamento de gerenciamento de projetos.", "c"], ["De que forma a transparência contribui para a melhoria contínua no Scrum?", "Permite que a equipe identifique áreas de aprimoramento no processo e no produto de forma mais eficaz.", "Elimina a necessidade de realizar a Sprint Retrospective.", "Torna desnecessário buscar feedback dos stakeholders.", "Garante que o projeto seja entregue sem erros.", "a"], ["Qual a relação entre a adaptação e a cultura de aprendizado contínuo no Scrum?", "A adaptação impede o aprendizado contínuo, pois gera instabilidade.", "A adaptação é essencial para o aprendizado contínuo, pois permite que a equipe aprenda com seus erros e melhore o produto e o processo.", "A adaptação é importante apenas para equipes iniciantes.", "A adaptação não tem relação com o aprendizado contínuo no Scrum.", "b"], ["Quem decide quais funcionalidades o produto deve ter?", "O Scrum Master.", "Os Developers.", "O Product Owner, com base no feedback dos stakeholders e na sua visão do produto.", "O cliente que encomendou o projeto.", "c"], ["O que significa dizer que o Scrum Team é “autogerenciado”?", "Que a equipe não precisa de um líder e cada um faz o que bem entender.", "Que o Scrum Master toma as decisões e a equipe apenas executa.", "Que a equipe tem autonomia para decidir como irá realizar o trabalho dentro da Sprint, sem a necessidade de um gerente para supervisionar cada passo.", "Que a equipe define os seus próprios horários e locais de trabalho, sem precisar seguir as regras da empresa.", "c"], ["Quem define o tamanho e a estimativa de esforço dos itens do Product Backlog?", "O Product Owner.", "O Scrum Master.", "Os Developers, em colaboração com o Product Owner.", "O Gerente de Projeto.", "c"], ["Qual a principal responsabilidade do Scrum Master no Scrum?", "Escrever o código do produto.", "Gerenciar o Product Backlog.", "Estabelecer o Scrum conforme definido no Guia Scrum e garantir que o Scrum Team esteja trabalhando de forma eficaz.", "Tomar as decisões sobre o produto.", "c"], ["Quais são os eventos Scrum que proporcionam a oportunidade de inspeção?", "Reunião diária, Reunião semanal e Reunião mensal.", "Sprint Planning, Daily Scrum, Sprint Review e Sprint Retrospective.", "Reunião de planejamento, Reunião de acompanhamento e Reunião de demonstração.", "Reunião de Kick-off, Reunião de Meio Termo e Reunião de Encerramento.", "b"], ["Quais elementos devem ser inspecionados em um projeto Scrum?", "Apenas o código fonte do produto", "O produto, o progresso em direção à meta, as ferramentas, os processos, as práticas e o próprio Scrum.", "Somente a documentação do projeto.", "As tarefas individuais de cada membro da equipe.", "b"], ["O que o Product Owner deve fazer se houver conflitos de interesse entre os stakeholders em relação às funcionalidades do produto?", "Atender aos pedidos do stakeholder que possui maior poder de decisão.", "Implementar as funcionalidades mais fáceis e rápidas primeiro, para agradar a todos.", "Deixar a equipe de desenvolvimento decidir o que é melhor para o produto.", "Facilitar a comunicação entre os stakeholders, buscar um entendimento comum e tomar a decisão que gere o maior valor para o produto, mesmo que nem todos os stakeholders fiquem satisfeitos.", "d"], ["Qual a relação entre os valores do Scrum e o sucesso de um projeto?", "Os valores do Scrum não têm impacto no sucesso do projeto.", "Os valores do Scrum são importantes apenas para a equipe de desenvolvimento.", "Os valores do Scrum criam um ambiente propício à colaboração, inovação e alto desempenho, aumentando as chances de sucesso do projeto.", "Os valores do Scrum tornam o projeto mais demorado e caro.", "c"], ["O que o Scrum Master deve fazer se um membro da equipe não estiver seguindo as práticas do Scrum?", "Repreender o membro da equipe publicamente.", "Descontar o erro no salário do membro da equipe.", "Conversar com o membro da equipe individualmente, entender o motivo do desvio e ajudá-lo a compreender e aplicar as práticas do Scrum.", "Ignorar o problema, pois cada um é responsável por seguir as práticas do Scrum.", "c"], ["De que forma a inspeção contribui para a melhoria contínua do processo Scrum?", "Torna o processo mais burocrático e lento.", "Permite à equipe identificar o que está funcionando bem e o que precisa ser melhorado.", "Desencoraja a equipe a experimentar novas práticas.", "Garante que a equipe nunca cometerá os mesmos erros.", "b"], ["Qual a importância da transparência no gerenciamento de riscos no Scrum?", "A transparência elimina todos os riscos do projeto.", "A transparência permite que a equipe identifique e gerencie os riscos de forma mais eficaz, pois todos têm acesso às mesmas informações.", "A transparência aumenta os riscos do projeto, pois expõe as vulnerabilidades da equipe.", "A transparência não tem relação com o gerenciamento de riscos no Scrum.", "b"], ["Qual a importância da inteligência coletiva no Scrum?", "É irrelevante, já que o Scrum define todas as etapas do processo.", "É importante apenas para a equipe de desenvolvimento.", "É fundamental, pois o Scrum se baseia na experiência e conhecimento de todas as pessoas envolvidas.", "É importante apenas para o Product Owner, que toma as decisões finais.", "c"], ["Qual a principal responsabilidade do Product Owner no Scrum?", "Maximizar o valor do produto resultante do trabalho do Scrum Team.", "Escrever o código do produto.", "Gerenciar o orçamento do projeto.", "Remover os impedimentos da equipe de desenvolvimento.", "a"], ["Qual a importância da transparência na comunicação do Scrum?", "Permite que o Scrum Master controle o trabalho da equipe.", "Facilita a colaboração e o entendimento compartilhado entre a equipe e os stakeholders.", "Cria uma sensação de desconfiança entre os membros da equipe.", "Torna as reuniões mais longas e improdutivas.", "b"], ["O que é Lean Thinking no contexto do Scrum?", "Uma metodologia para reduzir custos a todo custo.", "Uma abordagem que visa maximizar o valor do produto entregue, reduzindo o desperdício.", "Um processo para limitar a criatividade e a experimentação.", "Uma forma de gerenciar projetos com equipes pequenas e recursos limitados.", "b"], ["Quem são os Developers em um Scrum Team?", "Apenas os programadores.", "Os membros do Scrum Team que se comprometem a criar o incremento do produto a cada Sprint, incluindo programadores, testadores, designers, etc.", "O Scrum Master e o Product Owner.", "Qualquer pessoa que contribua para o projeto, mesmo que não faça parte do Scrum Team.", "c"], ["O que define a adaptação no contexto do Scrum?", "A capacidade da equipe de seguir o plano inicial sem alterações.", "O processo de ajustar o plano, o produto ou o processo Scrum, com base nas informações coletadas durante a inspeção.", "A habilidade de prever o futuro e evitar mudanças no projeto.", "A capacidade de trabalhar longas horas para cumprir os prazos.", "b"], ["O que significa dizer que o Scrum Team é “multifuncional”?", "Que cada membro da equipe domina várias linguagens de programação.", "Que os membros da equipe podem assumir diferentes papéis, como desenvolvimento, testes e design.", "Que a equipe possui todas as habilidades necessárias para transformar os itens do Product Backlog em incrementos de valor, sem depender de outros times.", "Que a equipe se reporta a múltiplos gerentes, cada um com sua especialidade.", "c"], ["Como o Scrum incentiva a entrega de valor em ciclos curtos?", "Definindo Sprints de no máximo duas semanas.", "Eliminando a necessidade de planejamento.", "Utilizando Sprints com timeboxes e entregas incrementais.", "Deixando a equipe decidir a duração de cada Sprint.", "c"], ["Qual a importância do feedback constante dentro do Scrum Team?", "O feedback constante gera conflitos e deve ser evitado.", "O feedback é importante apenas no final da Sprint.", "O feedback constante é essencial para que a equipe identifique e corrija erros rapidamente, aprenda com suas experiências e melhore o seu processo de trabalho.", "O feedback deve ser dado apenas pelo Scrum Master, que possui uma visão geral do projeto.", "c"], ["Como os valores do Scrum podem ajudar a construir um ambiente de trabalho mais positivo e produtivo?", "Criando um ambiente competitivo, onde cada um busca se destacar.", "Eliminando a necessidade de comunicação, pois todos já sabem o que precisa ser feito.", "Promovendo a confiança, o respeito mútuo e a comunicação aberta, o que leva à colaboração e ao engajamento da equipe.", "Centralizando as decisões no Scrum Master, que sabe o que é melhor para a equipe.", "c"], ["O que NÃO é uma característica fundamental do Scrum?", "Flexibilidade e adaptabilidade.", "Transparência e comunicação.", "Rigidez e controle.", "Colaboração e trabalho em equipe.", "c"], ["Qual a importância da comunicação entre os Developers durante a Sprint?", "A comunicação é importante apenas na Daily Scrum.", "A comunicação constante pode gerar distrações e deve ser evitada.", "A comunicação constante e transparente entre os Developers é fundamental para garantir a colaboração, identificar e resolver impedimentos rapidamente e garantir a qualidade do Incremento.", "A comunicação deve acontecer apenas por escrito, utilizando ferramentas de gestão de projetos.", "c"]]