[["O que é Scrum?", "Uma metodologia de gerenciamento de projetos.", "Um framework leve que ajuda a entregar valor por meio de soluções adaptativas.", "Um conjunto de ferramentas para desenvolvimento de software.", "Um processo linear e preditivo para gerenciar o trabalho.", "b"], ["Qual o objetivo principal do Scrum?", "Eliminar todos os riscos de um projeto.", "Gerar valor por meio de soluções adaptativas para problemas complexos.", "Definir um plano detalhado no início do projeto e segui-lo rigorosamente.", "Garantir que o projeto seja entregue dentro do prazo e orçamento estipulados.", "b"], ["Qual a relação do Scrum com processos, técnicas e métodos?", "O Scrum substitui todos os processos, técnicas e métodos existentes.", "O Scrum é incompatível com a maioria dos processos, técnicas e métodos.", "O Scrum se acopla a práticas existentes ou as torna desnecessárias, tornando sua eficácia visível.", "O Scrum exige a utilização de um conjunto específico de processos, técnicas e métodos.", "c"], ["Para que tipo de problema o Scrum é mais indicado?", "Problemas complexos com alto grau de incerteza.", "Problemas simples que podem ser facilmente resolvidos com um plano definido.", "Problemas que exigem um controle rígido sobre o processo.", "Problemas que não exigem a participação ativa do cliente.", "a"], ["Qual a importância da inteligência coletiva no Scrum?", "É irrelevante, já que o Scrum define todas as etapas do processo.", "É importante apenas para a equipe de desenvolvimento.", "É fundamental, pois o Scrum se baseia na experiência e conhecimento de todas as pessoas envolvidas.", "É importante apenas para o Product Owner, que toma as decisões finais.", "c"], ["O que significa dizer que o Scrum é um framework “leve”?", "Que ele pode ser aplicado apenas em projetos pequenos.", "Que ele não exige documentação.", "Que ele é fácil de aprender, mas difícil de dominar.", "Que ele é simples de entender, mas exige trabalho para ser implementado com sucesso.", "d"], ["O Scrum é mais comumente utilizado em que área?", "Engenharia civil.", "Medicina.", "Desenvolvimento de software.", "Marketing.", "c"], ["Qual a principal diferença entre o Scrum e o gerenciamento tradicional de projetos?", "O Scrum não utiliza cronogramas.", "O Scrum não se preocupa com o orçamento do projeto.", "O Scrum é iterativo e incremental, enquanto o gerenciamento tradicional é geralmente linear e preditivo.", "O Scrum não envolve stakeholders.", "c"], ["O que NÃO é uma característica fundamental do Scrum?", "Flexibilidade e adaptabilidade.", "Transparência e comunicação.", "Rigidez e controle.", "Colaboração e trabalho em equipe.", "c"], ["Qual a importância da experimentação no Scrum?", "É desencorajada, pois gera atrasos no projeto.", "É importante apenas na fase inicial do projeto.", "É fundamental para aprender e melhorar continuamente o produto e o processo.", "É responsabilidade exclusiva do Scrum Master.", "c"], ["Em que pilares a teoria do Scrum se baseia?", "Planejamento, execução, controle e entrega.", "Transparência, inspeção e adaptação.", "Comunicação, colaboração, integração e entrega.", "Visão, alinhamento, iteração e valor.", "b"], ["O que significa dizer que o Scrum é empírico?", "Que ele é baseado em dados estatísticos.", "Que ele se baseia na experiência e no aprendizado a partir do que já aconteceu.", "Que ele é um processo puramente teórico.", "Que ele não permite mudanças no plano original.", "b"], ["Como o Scrum lida com a incerteza em projetos complexos?", "Tentando eliminar todos os riscos e incertezas no início do projeto.", "Definindo um plano detalhado e imutável para lidar com todas as situações.", "Aceitando a incerteza e utilizando a inspeção e adaptação para lidar com ela.", "Ignorando a incerteza e focando apenas no que é conhecido.", "c"], ["O que é Lean Thinking no contexto do Scrum?", "Uma metodologia para reduzir custos a todo custo.", "Uma abordagem que visa maximizar o valor do produto entregue, reduzindo o desperdício.", "Um processo para limitar a criatividade e a experimentação.", "Uma forma de gerenciar projetos com equipes pequenas e recursos limitados.", "b"], ["Como o Scrum incentiva a entrega de valor em ciclos curtos?", "Definindo Sprints de no máximo duas semanas.", "Eliminando a necessidade de planejamento.", "Utilizando Sprints com timeboxes e entregas incrementais.", "Deixando a equipe decidir a duração de cada Sprint.", "c"], ["Qual a importância do feedback constante no Scrum?", "Serve apenas para satisfazer o cliente.", "É essencial para a inspeção e adaptação, permitindo que a equipe ajuste o curso e melhore o produto.", "É importante apenas no final de cada Sprint.", "É responsabilidade exclusiva do Product Owner.", "b"], ["Como o Scrum garante que a equipe esteja trabalhando nas tarefas mais importantes?", "Deixando a equipe decidir livremente em quais tarefas trabalhar.", "Utilizando gráficos de Gantt para controlar o progresso de cada tarefa.", "Priorizando os itens do Product Backlog e definindo a Meta da Sprint.", "Realizando reuniões diárias para verificar o status de cada tarefa.", "c"], ["O que significa “falhar cedo e aprender rápido” no contexto do Scrum?", "Entregar um produto com falhas para o cliente o mais rápido possível.", "Desistir do projeto ao primeiro sinal de problema.", "Identificar e corrigir erros o mais cedo possível, reduzindo o custo e o impacto das falhas.", "Não se preocupar com a qualidade do produto nas primeiras Sprints.", "c"], ["Qual a relação entre a Teoria do Scrum e os valores do Scrum?", "Não há relação entre os dois.", "Os valores do Scrum são independentes da Teoria do Scrum.", "A Teoria do Scrum define os valores do Scrum.", "Os valores do Scrum são a base para a aplicação da Teoria do Scrum.", "d"], ["O que NÃO é um princípio fundamental da Teoria do Scrum?", "Colaboração e trabalho em equipe.", "Entrega de valor em ciclos curtos.", "Micromanagement e controle.", "Adaptação e melhoria contínua.", "c"], ["No Scrum, o que significa ter \"transparência\"?", "Tornar as informações relevantes visíveis e acessíveis a todos os envolvidos no projeto.", "Documentar todos os detalhes do projeto em um sistema online.", "Compartilhar todas as informações, mesmo as irrelevantes, para evitar conflitos.", "Permitir que apenas o Scrum Master tenha acesso às informações do projeto.", "a"], ["Quais são os três artefatos do Scrum que promovem a transparência?", "Product Backlog, Sprint Backlog e Incremento.", "Visão do produto, Roadmap do produto e Backlog de Riscos.", "Diagrama de Gantt, Diagrama de Fluxo e Kanban.", "Relatório de Status, Atas de Reunião e Planilha de Orçamento.", "a"], ["Qual a importância da transparência na comunicação do Scrum?", "Permite que o Scrum Master controle o trabalho da equipe.", "Facilita a colaboração e o entendimento compartilhado entre a equipe e os stakeholders.", "Cria uma sensação de desconfiança entre os membros da equipe.", "Torna as reuniões mais longas e improdutivas.", "b"], ["Como a transparência contribui para a tomada de decisões no Scrum?", "Elimina a necessidade de tomar decisões difíceis.", "Permite que as decisões sejam tomadas com base em informações claras, reais e visíveis a todos.", "Torna o processo de tomada de decisão mais lento e burocrático.", "Centraliza as decisões no Product", "b"], ["O que pode acontecer quando há falta de transparência no Scrum?", "A equipe e os stakeholders podem ter dificuldade em colaborar e tomar decisões eficazes.", "O projeto se torna mais fácil de gerenciar, pois há menos informações para se preocupar.", "A equipe se torna mais motivada, pois não precisa se preocupar em comunicar o progresso.", "O projeto se torna mais previsível, pois todos trabalham com as mesmas informações limitadas.", "a"], ["De que forma a transparência impacta na cultura de uma equipe Scrum?", "Incentiva a confiança, a colaboração e a responsabilidade compartilhada.", "Cria um ambiente de competição e individualismo.", "Desencoraja a comunicação aberta e honesta.", "Torna a equipe resistente a mudanças.", "a"], ["Qual a relação entre transparência e a Definição de “Pronto” no Scrum?", "Não há relação entre os dois conceitos.", "A Definição de “Pronto” precisa ser clara e transparente para que todos os envolvidos saibam o que esperar do trabalho da equipe.", "A Definição de “Pronto” é definida pelo Scrum Master e mantida em segredo para evitar conflitos.", "A Definição de “Pronto” é um documento extenso e detalhado que define todos os aspectos do produto.", "b"], ["Como a transparência se aplica à comunicação com os stakeholders?", "Os stakeholders devem ter acesso irrestrito a todas as informações do projeto.", "Os stakeholders devem receber informações relevantes e atualizadas sobre o progresso do projeto de forma regular e transparente.", "A comunicação com os stakeholders deve ser evitada ao máximo para não gerar expectativas.", "O Scrum Master é o único responsável por comunicar com os stakeholders.", "b"], ["De que forma a transparência contribui para a melhoria contínua no Scrum?", "Permite que a equipe identifique áreas de aprimoramento no processo e no produto de forma mais eficaz.", "Elimina a necessidade de realizar a Sprint Retrospective.", "Torna desnecessário buscar feedback dos stakeholders.", "Garante que o projeto seja entregue sem erros.", "a"], ["Qual a importância da transparência no gerenciamento de riscos no Scrum?", "A transparência elimina todos os riscos do projeto.", "A transparência permite que a equipe identifique e gerencie os riscos de forma mais eficaz, pois todos têm acesso às mesmas informações.", "A transparência aumenta os riscos do projeto, pois expõe as vulnerabilidades da equipe. d) A transparência não tem relação com o gerenciamento de riscos no Scrum.", "b", ""], ["O que a inspeção representa dentro do Scrum?", "Uma atividade crucial para garantir que o framework esteja sendo aplicado corretamente e gere os resultados esperados.", "Uma tarefa exclusiva do Scrum Master para verificar o trabalho da equipe.", "Um processo burocrático que atrasa o desenvolvimento do projeto.", "Uma atividade opcional que pode ser realizada apenas quando houver tempo disponível.", "a"]]